vstkl/cardputer/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_EXAMPLE_KBD_ENABLE=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_SM_LVL=2
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_SVC_GAP_DEVICE_NAME="CardputerADV Keyboard"
CONFIG_BT_NIMBLE_SVC_BAS_BATTERY_LEVEL_NOTIFY=y
# Request connection parameters optimised for a HID keyboard.
# See ble_gap_upd_params in source code for dynamic set.
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_MIN_CONN_INTERVAL=12
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_MAX_CONN_INTERVAL=48
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_SLAVE_LATENCY=8
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_SUPERVISION_TMO=600
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# Power management: allow dynamic frequency scaling (80–160 MHz) and automatic
# light sleep when all tasks are blocked.  CPU still boots at 240 MHz; pm_init()
# in airmon.cpp caps it to 160 MHz at runtime.
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=3
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESPNOW_CONTROL_AUTO_CHANNEL_SENDING=y
CONFIG_ESPNOW_CONTROL_AUTO_CHANNEL_FORWARD=y
CONFIG_TINYUSB_HID_COUNT=1
